import re

# text = '123'\
#        '+79261234567'\
#        '+89261234567'\
#        '+77271212888'\
#        '+9271255512'\
#        '8 927 123 8 123'
#
#
# tel = r"^\+79\d{9}(?=\s|$)"
#
# result = re.fullmatch(tel, text)
# print(result)


# text = '/send 345645766 Language: python3 ource: s = '
#
# # search = re.search(r'@(\S+)', text)
# # print(search.group(0))
#
# search = re.search(r'\b@(\S+)', text)
# print(search)
# print(text.split(" ", 2)[-1])
# print(text.split(" ", 2)[1])







"""
(?<!\d) - сразу слева не должно быть цифры
(?:0?[1-9]|[12][0-9]|3[01]) - целые числа от 1 до 31 (перед числами от 1 до 9 может быть необязательный 0)
- - дефис
(?:0?[1-9]|1[0-2]) - целые числа от 1 до 12 (перед числами от 1 до 9 может быть необязательный 0)
- - дефис
(?:19[0-9][0-9]|20[01][0-9]) - целые числа от 1900 до 2019
(?!\d) - сразу справа не должно быть цифры

"""
pattern = r'(?<!\d)(?:0[1-9]|[12][0-9]|3[01]).(?:0[1-9]|1[0-2]).(?:20[02][0-9]) (?:0[1-9]|1[0-9]|2[0-4]):(?:0[1-9]|[12345][0-9])(?!\d)'


def test(s):
    result = re.fullmatch(pattern=pattern, string=s)
    if result:
        print(s, 'yes')
    else:
        print(s, 'no')


test('31.12.2020 23:59')  # yes
test('31.12.2020 33:59')  # no
test('45.12.2020 20:59')  # no
test('25.34.2020 21:59')  # no
test('25.34.2020 22:59')  # no
test('25.10.3050 22:59')  # no
test('25.10.3050 22:78')  # no
test('2.10.2020 15:01')  # no
test('02.5.2019 15:00')  # no
test('02.55.1515 15:00')  # no
